
var ary=[
    "习近平批准规范军队福利将清理经适房",
    "李克强召开会议 明确政府工作报告部门分工",
    "苹果推以旧换新计划 欲蚕食安卓手机市场",
    "最高检：李春城蒋洁敏被提起公诉",
    "腾讯财报真相：增值业务放缓 广告营收空间有限",
    "广西桂林景区山石坠落击中游客 已致7死25伤",
    "习近平批准规范军队福利将清理经适房",
    "李克强召开会议 明确政府工作报告部门分工",
    "苹果推以旧换新计划 欲蚕食安卓手机市场",
    "最高检：李春城蒋洁敏被提起公诉",
    "腾讯财报真相：增值业务放缓 广告营收空间有限",
    "广西桂林景区山石坠落击中游客 已致7死25伤",
    "习近平批准规范军队福利将清理经适房",
    "李克强召开会议 明确政府工作报告部门分工",
    "苹果推以旧换新计划 欲蚕食安卓手机市场",
    "最高检：李春城蒋洁敏被提起公诉",
    "腾讯财报真相：增值业务放缓 广告营收空间有限",
    "广西桂林景区山石坠落击中游客 已致7死25伤",
    "习近平批准规范军队福利将清理经适房",
    "李克强召开会议 明确政府工作报告部门分工",
    "苹果推以旧换新计划 欲蚕食安卓手机市场",
    "最高检：李春城蒋洁敏被提起公诉",
    "腾讯财报真相：增值业务放缓 广告营收空间有限",
    "广西桂林景区山石坠落击中游客 已致7死25伤"
];

extendList.init({
    ele:document.getElementById("div1"),
    data:ary,
    color:["red","yellow","green"],
    sel:"black",
    isSupport:true
});
